src/InformationRegisters/ИсторияВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаправлениеВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНаправленияВызова</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПользовательSip</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРазговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеЗвонка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗвонка</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>URLЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятДругимАбонентомГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОбрабатывающего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПривлечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоллтрекингНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомерСотрудника</Name>
					<Comment>Добавочный номер для ITOOLABSE</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокПолученияФайлаЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыОбработкиЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОбработкиЗвонка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОборудованиеТелефонии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЖурналЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЖурналЗапросов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HTTPСервисы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнееПриложение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ApiKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтносительныйURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPМетод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>UserToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЭвотор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>UIDЗапроса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗвонка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗвонка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вызов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДозвон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/HTTPСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>HTTPСервисы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Analytics</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Apex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Director</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Evotor</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IronLogic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Lead</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Mandarin</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Messenger</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧатБот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BePaid</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗапросов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TimedOut</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершенСОшибками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаApiKey</Name>
					<Comment>Не передан ApiKey</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаАвторизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВнешнейСистемы</Name>
					<Comment>Не найдена внешняя система</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСоединения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/HTTPServices/IPТелефония/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиМетодовHTTP

// Функция - OKTELLRun function POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция OKTELLRunFunctionPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.OKTELLRunFunction", УровеньЖурналаРегистрации.Информация, , , 
				"Вызов функции '" + Запрос.ПараметрыURL.Получить("ИмяФункции") + "'"
				+ Символы.ПС + "Переданные параметры:"
				+ Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
				
	Ответ1С = Новый Структура("Success, Description", Истина, "");
	
	Попытка
		
		// Чтение данных JSON из тела
		ИмяФункции = Запрос.ПараметрыURL.Получить("ИмяФункции");
		ПараметрыJSON = ДекодироватьИзJSON(Запрос.ПолучитьТелоКакСтроку());
		
		// Проверка Аутоидентификации
		IPТелефонияПодключаемоеОборудование = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсOKTELL);
		Если Не ЗначениеЗаполнено(IPТелефонияПодключаемоеОборудование) Тогда
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии в не настроен)";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
		КонецЕсли;
		
		// Обработка события
		Если ИмяФункции = "GetInternalManager" Тогда
			СтруктураЛичныйМенеджер = IPТелефония.ПолучитьЛичногоМенеджераДляПереадресации(ПараметрыJSON.ExternalNumber, Ответ1С.Description);
			Если НЕ ЗначениеЗаполнено(Ответ1С.Description) Тогда
				Для Каждого ПараметрСтруктуры Из СтруктураЛичныйМенеджер Цикл
					Ответ1С.Вставить(ПараметрСтруктуры.Ключ, ПараметрСтруктуры.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяФункции = "GetInternalManager" Тогда
			ИмяФункции = "IncomingCall";
		КонецЕсли;
		
		Ответ1С.Success = IPТелефония.OKTELL_СобытиеЗвонок(IPТелефонияПодключаемоеОборудование, ИмяФункции, ПараметрыJSON, Ответ1С.Description);
		
		Если Ответ1С.Success = Ложь Тогда
			ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.OKTELLRunFunction", УровеньЖурналаРегистрации.Предупреждение, , , 
						ИмяФункции + Символы.ПС + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		КонецЕсли;				
		
		Возврат ПолучитьHTTPОтветAPI(?(Ответ1С.Success, 200, 400), Ответ1С, Истина);
		
	Исключение
				
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.OKTELLRunFunction", УровеньЖурналаРегистрации.Ошибка, , , 
						ИмяФункции + Символы.ПС + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
						
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);
						
	КонецПопытки;
			
КонецФункции

// Функция - MANGOEvents call POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция MANGOEventsCallPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsCall", УровеньЖурналаРегистрации.Информация, , , 
						"Вызов функции. Переданные параметры: " + Символы.ПС + РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL));
						
	Ответ1С = Новый Структура("Success, Description", Истина, "");
						
	Попытка
		
		// Чтение данных JSON из тела
		ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
		СтруктураПараметрыТелоЗапроса = Новый Структура;
		ОжидаемыеПараметры = Новый Структура("vpbx_api_key, sign, json");
		Для Каждого ЭлементОжидаемыйПараметр Из ОжидаемыеПараметры Цикл
			Для Каждого ЭлементМассива Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТелоЗапроса, "&") Цикл
				Если СтрНайти(ЭлементМассива, ЭлементОжидаемыйПараметр.Ключ) <> 0 Тогда
					СтруктураПараметрыТелоЗапроса.Вставить(ЭлементОжидаемыйПараметр.Ключ, СтрЗаменить(ЭлементМассива, ЭлементОжидаемыйПараметр.Ключ + "=", ""));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

		// Проверка Аутоидентификации
		IPТелефонияПодключаемоеОборудование = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO, СтруктураПараметрыТелоЗапроса.vpbx_api_key);
		Если Не ЗначениеЗаполнено(IPТелефонияПодключаемоеОборудование) Тогда
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии в настроен)";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
		ИначеЕсли MANGOПроверитьАутоидентификацию(IPТелефонияПодключаемоеОборудование, СтруктураПараметрыТелоЗапроса.JSON, СтруктураПараметрыТелоЗапроса.Sign, Запрос.ОтносительныйURL) = Ложь Тогда
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтруктураПараметрыТелоЗапроса.JSON);
		ПараметрыЗапросаJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		ОбязательныеПараметры = Новый Массив;
		ОбязательныеПараметры.Добавить("entry_id");
		ОбязательныеПараметры.Добавить("call_id");
		ОбязательныеПараметры.Добавить("timestamp");
		ОбязательныеПараметры.Добавить("seq");
		ОбязательныеПараметры.Добавить("call_state");
		ОбязательныеПараметры.Добавить("location");
		ОбязательныеПараметры.Добавить("to");
		ОбязательныеПараметры.Добавить("from");
		
		Для Каждого ОбязательныйПараметр Из ОбязательныеПараметры Цикл
			Если Не ПараметрыЗапросаJSON.Свойство(ОбязательныйПараметр) Тогда
				Ответ1С.Success = Ложь;					
				Ответ1С.Description = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.'"), ОбязательныйПараметр);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Ответ1С.Success = Ложь Тогда
			Возврат ПолучитьHTTPОтветAPI(400, Ответ1С, Истина);	
		КонецЕсли;
		
		Ответ1С.Success = IPТелефония.MANGO_СобытиеЗвонок(IPТелефонияПодключаемоеОборудование, ПараметрыЗапросаJSON, Ответ1С.Description);
		
		Если Ответ1С.Success = Ложь Тогда
			ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsCall", УровеньЖурналаРегистрации.Предупреждение, , , 
			"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		КонецЕсли;		
		
		Возврат ПолучитьHTTPОтветAPI(?(Ответ1С.Success, 200, 400), Ответ1С, Истина, Истина);
		
	Исключение
				
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsCall", УровеньЖурналаРегистрации.Ошибка, , , 
						"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);
		
	КонецПопытки;
		
КонецФункции

// Функция - MANGOEvents summary POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция MANGOEventsSummaryPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsSummary", УровеньЖурналаРегистрации.Информация, , , 
						"Вызов функции. Переданные параметры: " + Символы.ПС + РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL));
						
	Ответ1С = Новый Структура("Success, Description", Истина, "");
						
	Попытка
		
		// Чтение данных JSON из тела
		ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
		СтруктураПараметрыТелоЗапроса = Новый Структура;
		ОжидаемыеПараметры = Новый Структура("vpbx_api_key, sign, json");
		Для Каждого ЭлементОжидаемыйПараметр Из ОжидаемыеПараметры Цикл
			Для Каждого ЭлементМассива Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТелоЗапроса, "&") Цикл
				Если СтрНайти(ЭлементМассива, ЭлементОжидаемыйПараметр.Ключ) <> 0 Тогда
					СтруктураПараметрыТелоЗапроса.Вставить(ЭлементОжидаемыйПараметр.Ключ, СтрЗаменить(ЭлементМассива, ЭлементОжидаемыйПараметр.Ключ + "=", ""));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;

		// Проверка Аутоидентификации
		IPТелефонияПодключаемоеОборудование = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO, СтруктураПараметрыТелоЗапроса.vpbx_api_key);
		Если Не ЗначениеЗаполнено(IPТелефонияПодключаемоеОборудование) Тогда
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутоидентификация не пройдена (Сервис IP-телефонии в 1С не настроен).";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
		ИначеЕсли MANGOПроверитьАутоидентификацию(IPТелефонияПодключаемоеОборудование, СтруктураПараметрыТелоЗапроса.JSON, СтруктураПараметрыТелоЗапроса.Sign, Запрос.ОтносительныйURL) = Ложь Тогда
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутоидентификация не пройдена.";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтруктураПараметрыТелоЗапроса.JSON);
		ПараметрыЗапросаJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		ОбязательныеПараметры = Новый Массив;
		ОбязательныеПараметры.Добавить("entry_id");
		ОбязательныеПараметры.Добавить("to");
		ОбязательныеПараметры.Добавить("from");
		ОбязательныеПараметры.Добавить("call_direction"); 	// направление вызова: 0 – внутренний, 1 – входящий, 2 – исходящий
		ОбязательныеПараметры.Добавить("entry_result"); 	// результат вызова: 1 - звонок успешен и разговор состоялся, 0 - звонок пропущен, разговор не состоялся
		
		Для Каждого ОбязательныйПараметр Из ОбязательныеПараметры Цикл
			Если Не ПараметрыЗапросаJSON.Свойство(ОбязательныйПараметр) Тогда
				Ответ1С.Success = Ложь;					
				Ответ1С.Description = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.'"), ОбязательныйПараметр);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Ответ1С.Success = Ложь Тогда
			Возврат ПолучитьHTTPОтветAPI(400, Ответ1С, Истина);
		КонецЕсли;
		
		Ответ1С.Success = IPТелефония.MANGO_СобытиеЗавершениеЗвонка(IPТелефонияПодключаемоеОборудование, ПараметрыЗапросаJSON, Ответ1С.Description);
						
		Если Ответ1С.Success = Ложь Тогда
			ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsSummary", УровеньЖурналаРегистрации.Предупреждение, , , 
						"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		КонецЕсли;		
		
		Возврат ПолучитьHTTPОтветAPI(?(Ответ1С.Success, 200, 400), Ответ1С, Истина, Истина);
		
	Исключение
				
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsSummary", УровеньЖурналаРегистрации.Ошибка, , , 
						"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);
		
	КонецПопытки;
		
КонецФункции

// Функция - MANGOEvents recording POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция MANGOEventsRecordingPOST(Запрос)

	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsRecording", УровеньЖурналаРегистрации.Информация, , , 
						"Вызов функции. Переданные параметры: " + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
	
	Ответ1С = Новый Структура("Success, Description", Истина, "");
	
	Попытка

		// Чтение данных JSON из тела
		ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
		СтруктураПараметрыТелоЗапроса = Новый Структура;
		ОжидаемыеПараметры = Новый Структура("vpbx_api_key, sign, json");
		Для Каждого ЭлементОжидаемыйПараметр Из ОжидаемыеПараметры Цикл
			Для Каждого ЭлементМассива Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТелоЗапроса, "&") Цикл
				Если СтрНайти(ЭлементМассива, ЭлементОжидаемыйПараметр.Ключ) <> 0 Тогда
					СтруктураПараметрыТелоЗапроса.Вставить(ЭлементОжидаемыйПараметр.Ключ, СтрЗаменить(ЭлементМассива, ЭлементОжидаемыйПараметр.Ключ + "=", ""));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Проверка Аутоидентификации
		IPТелефонияПодключаемоеОборудование = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсMANGO, СтруктураПараметрыТелоЗапроса.vpbx_api_key);
		Если Не ЗначениеЗаполнено(IPТелефонияПодключаемоеОборудование) Тогда
			
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии в не настроен)";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
			
		ИначеЕсли MANGOПроверитьАутоидентификацию(IPТелефонияПодключаемоеОборудование, СтруктураПараметрыТелоЗапроса.JSON, СтруктураПараметрыТелоЗапроса.Sign, Запрос.ОтносительныйURL) = Ложь Тогда
			
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
			
		КонецЕсли;
		
		Ответ1С.Success = IPТелефония.MANGO_СобытиеЗаписьРазговора(IPТелефонияПодключаемоеОборудование, ДекодироватьИзJSON(СтруктураПараметрыТелоЗапроса.JSON), Ответ1С.Description);			
		
		Возврат ПолучитьHTTPОтветAPI(?(Ответ1С.Success, 200, 400), Ответ1С, Истина, Истина);
		
	Исключение
				
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.MANGOEventsCall", УровеньЖурналаРегистрации.Ошибка, , , 
						"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);
		
	КонецПопытки;
	
КонецФункции

// Функция - Itoolabs event POST
//
Функция ITOOLABSEventsPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.ITOOLABSEvents", УровеньЖурналаРегистрации.Информация, , , 
	"Вызов функции. Переданные параметры: " + Символы.ПС + РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL));
	
	Ответ1С = Новый Структура("Success, Description", Истина, "");
	
	ТелоЗапроса   = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);	
	ПараметрыТела = ПолучитьПараметрыИзСтроки(ТелоЗапроса, "&");	
	
	Попытка
		
		// Проверка Аутоидентификации
		ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсITOOLABS);
		
		Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда	
			Ответ1С.Success 	= Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии не настроен)";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
		КонецЕсли;
		
		IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
		
		Токен = ?(ЗначениеЗаполнено(IPТелефонияПараметры.Токен), IPТелефонияПараметры.Токен, IPТелефонияПараметры.Ключ); 
		
		Если Не ПараметрыТела.crm_token = Токен Тогда
			Ответ1С.Success 	= Ложь;
			Ответ1С.Description = "Аутентификация не пройдена";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);		
		КонецЕсли;
		
		ОбязательныйПараметр = "cmd";						
		Если Не ПараметрыТела.Свойство(ОбязательныйПараметр) Тогда
			
			Ответ1С.Success     = Ложь;					
			Ответ1С.Description = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.'"), ОбязательныйПараметр);
			Возврат ПолучитьHTTPОтветAPI(400, Ответ1С, Истина);
			
		КонецЕсли;      			
		
		Если ПараметрыТела.cmd = "event" Тогда
			// Могут прислать 2 запроса если телефоны работают в группе, второму прилетает тип - пропущенный, будем его игнорировать
			ЭтоДубльЗвонка = Ложь;
			Если ПараметрыТела.type = "CANCELLED" Тогда
				ЭтоДубльЗвонка = ПроверкаITOOLABS(ПОIPТелефонии, ПараметрыТела.callid); 
			КонецЕсли;
			Если НЕ ЭтоДубльЗвонка Тогда
				Ответ1С.Success = IPТелефония.ITOOLABS_СобытиеЗвонок(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);
			КонецЕсли;
		ИначеЕсли ПараметрыТела.cmd = "history" Тогда
			Ответ1С.Success = IPТелефония.ITOOLABS_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);
			//ИначеЕсли ПараметрыТела.cmd = "contact" Тогда
			//	Ответ = IPТелефония.ITOOLABS_ПереадресацияЗвонка(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);					
		КонецЕсли;
		
		Возврат ПолучитьHTTPОтветAPI(200, Ответ1С, Истина);
		
	Исключение
		
		Ответ1С.Success     = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.ITOOLABSEvents", УровеньЖурналаРегистрации.Ошибка, , , 
		"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);
		
	КонецПопытки;
	
КонецФункции

// Функция - Binotel events POST
//
Функция BINOTELEventsPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.BINOTELEvents", УровеньЖурналаРегистрации.Информация, , , 
	"Вызов функции. Переданные параметры: " + Символы.ПС + РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL));
	
	Ответ1С = Новый Структура("Success, Description", Истина, "");
	
	ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
	
	ПараметрыТела = Новый Структура();
	
	Для Каждого ЭлементМассива Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТелоЗапроса, "&") Цикл
		
		Массив = СтрРазделить(ЭлементМассива, "=");
		РаспарситьСтроку(ПараметрыТела, Массив[0], Массив[1]); 			
		
	КонецЦикла;
	
	Попытка
		
		// Проверка Аутоидентификации
		ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсBINOTEL);
		
		Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда			
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии не настроен)";
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);			
		КонецЕсли;
		
		IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
		
		ОбязательныйПараметр = "generalCallID";							
		Если Не ПараметрыТела.Свойство(ОбязательныйПараметр) И Не (ПараметрыТела.Свойство("callDetails") И ПараметрыТела.callDetails.Свойство(ОбязательныйПараметр)) Тогда
			
			Ответ1С.Success = Ложь;					
			Ответ1С.Description = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.'"), ОбязательныйПараметр);
			Возврат ПолучитьHTTPОтветAPI(400, Ответ1С, Истина);
			
		КонецЕсли;      			
		
		requestType = ?(ПараметрыТела.Свойство("requestType"), ПараметрыТела.requestType, Неопределено);
		Ответ1С.Success = IPТелефония.BINOTEL_СобытиеЗвонок(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);		
		
		disposition = ?(ПараметрыТела.Свойство("disposition"), ПараметрыТела.disposition, Ложь); 
		
		Если requestType = "apiCallCompleted" 
			И Не (disposition = "CONGESTION" 
			ИЛИ disposition = "CHANUNAVAIL"
			ИЛИ disposition = "BUSY"
			ИЛИ disposition = "NOANSWER"
			ИЛИ disposition = "CANCEL") Тогда 
			Ответ1С.Success = IPТелефония.BINOTEL_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);				
		КонецЕсли;	
		
		Возврат ПолучитьHTTPОтветAPI(?(Ответ1С.Success, 200, 400), Ответ1С, Истина);	
		
	Исключение
		
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.BINOTELEvents", УровеньЖурналаРегистрации.Ошибка, , , 
		"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);
		
	КонецПопытки;  
	
КонецФункции   

// Функция - ROSTELECOMEvents POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ROSTELECOMEventsPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ответ1С = Новый Структура("Success, Description", Истина, "");
	
	//АпиКей           = Запрос.ПараметрыURL.Получить("ApiKey");
	ЗаголовкиЗапроса = ПривестиЗаголовкиВНижнийРегистр(Запрос);
	ClientID         = ЗаголовкиЗапроса.Получить("clientid");
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ПараметрыJSON = ПолучитьПараметрыЗапроса(ТелоЗапроса);
	
	Если ПараметрыJSON = Неопределено Тогда
		Возврат ПолучитьHTTPОтветAPI(400, "Ошибка формата JSON: " + ТелоЗапроса);		
	КонецЕсли;
	
	ЭтоДобавлениеРК = ?(СтрНайти(Запрос.ОтносительныйURL, "get_campaign") > 0, Истина, Ложь);
	Попытка
 		
		ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсROSTELECOM);
		
		Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда
			Возврат ПолучитьHTTPОтветAPI(401, "Аутентификация не пройдена (Сервис IP-телефонии не настроен)");
		КонецЕсли;
		                                     
		IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
		Токен				 = ?(ТипЗнч(IPТелефонияПараметры) = Тип("Структура") И IPТелефонияПараметры.Свойство("Код"), IPТелефонияПараметры.Код, Неопределено); 
		
		Если Не ЗначениеЗаполнено(IPТелефонияПараметры) ИЛИ ТипЗнч(IPТелефонияПараметры) <> Тип("Структура") Тогда			
			
			Возврат ПолучитьHTTPОтветAPI(400, "Аутентификация не пройдена (Параметры IP-телефонии не настроены)");			
			
		ИначеЕсли ЭтоДобавлениеРК Тогда
			
			IPТелефония.ROSTELECOM_ДополнитьЗвонокРекламнойКомпанией(ПОIPТелефонии, ПараметрыJSON);
			
			Возврат ПолучитьHTTPОтветAPI(200, "Выполнено успешно");
			
		ИначеЕсли Токен <> ClientID Тогда
			
			Возврат ПолучитьHTTPОтветAPI(401, "Аутентификация не пройдена (Передан неверный токен)");
			
		ИначеЕсли Не ПараметрыJSON.Свойство("state") Тогда
			
			Возврат ПолучитьHTTPОтветAPI(400, "Отсутствует обязательный параметр: state.");
			
		КонецЕсли;
		
 		Ответ1С.Success = IPТелефония.ROSTELECOM_СобытиеЗвонок(ПОIPТелефонии, ПараметрыJSON, IPТелефонияПараметры, Ответ1С.Description);
		
		Если НЕ Ответ1С.Success Тогда
			Возврат ПолучитьHTTPОтветAPI(400, Ответ1С.Description);
		КонецЕсли;
		
		Если НРег(ПараметрыJSON.state) = "end" И ПараметрыJSON.Свойство("is_record") И Булево(ПараметрыJSON.is_record) Тогда
			Ответ1С.Success = IPТелефония.ROSTELECOM_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыJSON, IPТелефонияПараметры, Ответ1С.Description); 								
		КонецЕсли;
		
		Возврат ПолучитьHTTPОтветAPI(200, "Выполнено успешно");
		
	Исключение
		
		Возврат ПолучитьHTTPОтветAPI(500, ОписаниеОшибки());

	КонецПопытки;	

КонецФункции

// Функция - CoMagicEvents POST
//
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция CoMagicEventsPOST(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.CoMagicEvents", УровеньЖурналаРегистрации.Информация, , , 
						"Вызов функции '" + Запрос.ПараметрыURL.Получить("ИмяФункции") + "'"
						+ Символы.ПС + "Переданные параметры: " + Символы.ПС + РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL));
						
	Ответ1С = Новый Структура("Success, Description", Истина, "");
						
	Попытка
		
		ТелоЗапроса = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);
		ТелоЗапросаJSON = ДекодироватьИзJSON(ТелоЗапроса);
		
		ИмяФункции = Запрос.ПараметрыURL.Получить("ИмяФункции");
		ТелоЗапросаJSON.Вставить("Method", ИмяФункции);
				
		// Проверка Аутоидентификации
		IPТелефонияПодключаемоеОборудование = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCoMagic);
		
		Если Не ЗначениеЗаполнено(IPТелефонияПодключаемоеОборудование) Тогда
			
			Ответ1С.Success     = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии не настроен)";			
			Возврат ПолучитьHTTPОтветAPI(401, Ответ1С, Истина);
			
		КонецЕсли;
		
		Если ИмяФункции = "preAppeared" Тогда
			
			СтруктураЛичныйМенеджер = IPТелефония.ПолучитьЛичногоМенеджераДляПереадресации(ТелоЗапросаJSON.contact_info.contact_phone_number, Ответ1С.Description);
			Если НЕ ЗначениеЗаполнено(Ответ1С.Description) Тогда
				Ответ1С.Вставить("phones", Новый_Массив(СтруктураЛичныйМенеджер.InternalNumberGroup));
			КонецЕсли;
			
		Иначе
			
			Ответ1С.Success = IPТелефония.CoMagic_СобытиеЗвонок(IPТелефонияПодключаемоеОборудование, ТелоЗапросаJSON, Ответ1С.Description);
			
			Если Ответ1С.Success = Ложь Тогда
				
				ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.CoMagicEvents", УровеньЖурналаРегистрации.Предупреждение, , , 
				"" + Ответ1С.Description + Символы.ПС + ТелоЗапроса);
				
				Возврат ПолучитьHTTPОтветAPI(400, Ответ1С, Истина);

			КонецЕсли;
			
		КонецЕсли;
		
		Ответ1С.Success     = Истина;
		Ответ1С.Description = "Выполнено успешно";		
		Возврат ПолучитьHTTPОтветAPI(200, Ответ1С, Истина);

	Исключение
		
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.CoMagicEvents", УровеньЖурналаРегистрации.Ошибка, , , 
		"" + Ответ1С.Description + Символы.ПС + ТелоЗапроса);
		
		Возврат ПолучитьHTTPОтветAPI(500, Ответ1С, Истина);

	КонецПопытки;
		
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
   
// Функция - проверяет на дубль звонок
//
Функция ПроверкаITOOLABS(ПОIPТелефонии, IDЗвонка) Экспорт
	
	НаборЗаписей = РегистрыСведений.ИсторияВызовов.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Значение 		= ПОIPТелефонии;
	НаборЗаписей.Отбор.ОборудованиеТелефонии.Использование 	= Истина;
	НаборЗаписей.Отбор.IDЗвонка.Значение 					= IDЗвонка;
	НаборЗаписей.Отбор.IDЗвонка.Использование 				= Истина;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		Запись = НаборЗаписей[0];
		Если Запись.Статус = Перечисления.СтатусыЗвонка.Разговор Тогда
			Возврат Истина;			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура - Распарсить строку
//
Процедура РаспарситьСтроку(ПараметрыТела, Ключ, Значение) 	
		
	Если СтрНайти(Ключ, "[") <> 0 Тогда
		
		Ключ = СтрРазделить(Ключ, "[");
		Если Прав(Ключ[1], 1) = "]" Тогда
			Ключ[1] = Лев(Ключ[1], СтрДлина(Ключ[1]) - 1);
		КонецЕсли;
		
		Попытка
			Ключ[0] = Число(Ключ[0]);
		Исключение
		КонецПопытки;  		
		
		Если ТипЗнч(Ключ[0]) <> Тип("Число") 
			И Не ПараметрыТела.Свойство(Ключ[0]) Тогда 
			
			Попытка
				
				Если Ключ.Количество() > 1 Тогда 
					
					Индекс = Число(Лев(Ключ[1], 1));					
					ПараметрыТела.Вставить(Ключ[0], Новый Массив());
					
				КонецЕсли;
				
			Исключение
				ПараметрыТела.Вставить(Ключ[0], Новый Структура());				
			КонецПопытки;
			
		КонецЕсли;
		
		Если Ключ.Количество() > 2 Тогда
			
			Пока Ключ.Количество() > 1 Цикл
				
				времКлюч = "" + времКлюч + Ключ[1] + ?(Ключ.Количество()>2, "[", "");
				
				Ключ.Удалить(1);
				
			КонецЦикла;
			
			РаспарситьСтроку(ПараметрыТела[Ключ[0]], времКлюч, Значение);
		Иначе
			
			Если ТипЗнч(Ключ[0]) = Тип("Число") 
				И ТипЗнч(ПараметрыТела) = Тип("Массив") 
				И ПараметрыТела.Количество() = Ключ[0] Тогда 
				ПараметрыТела.Добавить(Новый Структура());				
			КонецЕсли;
			РаспарситьСтроку(ПараметрыТела[Ключ[0]], Ключ[1], Значение);
			
		КонецЕсли;	
		
	Иначе 
		RawDataВСтруктуру(ПараметрыТела, Ключ, Значение);			
	КонецЕсли;
	
КонецПроцедуры   

// Процедура - Raw data в структуру
//
Процедура RawDataВСтруктуру(ПараметрыТела, Ключ, Значение)
		
	Если Лев(Ключ, 1) = "[" Тогда
		Ключ = Прав(Ключ, СтрДлина(Ключ) - 1);
	КонецЕсли; 	
		
	ПараметрыТела.Вставить(Ключ, Значение);			
	
КонецПроцедуры

// Функция - Получить параметры из строки
//
Функция ПолучитьПараметрыИзСтроки(Знач СтрокаПараметров, Знач Разделитель = ";") Экспорт
	
	Результат = Новый Структура;
	
	ОписаниеПараметра = "";
	НайденоНачалоСтроки = Ложь;
	НомерПоследнегоСимвола = СтрДлина(СтрокаПараметров);
	Для НомерСимвола = 1 По НомерПоследнегоСимвола Цикл
		Символ =Сред(СтрокаПараметров, НомерСимвола, 1);
		Если Символ = """" Тогда
			НайденоНачалоСтроки = Не НайденоНачалоСтроки;
		КонецЕсли;
		Если Символ <> Разделитель Или НайденоНачалоСтроки Тогда
			ОписаниеПараметра = ОписаниеПараметра + Символ;
		КонецЕсли;
		Если Символ = Разделитель И Не НайденоНачалоСтроки Или НомерСимвола = НомерПоследнегоСимвола Тогда
			Позиция = СтрНайти(ОписаниеПараметра, "=");
			Если Позиция > 0 Тогда
				ИмяПараметра = СокрЛП(Лев(ОписаниеПараметра, Позиция - 1));
				ЗначениеПараметра = СокрЛП(Сред(ОписаниеПараметра, Позиция + 1));
				ЗначениеПараметра = СтроковыеФункцииКлиентСервер.СократитьДвойныеКавычки(ЗначениеПараметра);
				Попытка
					Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
				Исключение
				КонецПопытки;
			КонецЕсли;
			ОписаниеПараметра = "";
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Функция - MANGOПроверить аутоидентификацию
//
// Параметры:
//  IPТелефонияПодключаемоеОборудование	 - 	 - 
//  JSONСообщение						 - 	 - 
//  Sign								 - 	 - 
//  ОтносительныйURL					 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция MANGOПроверитьАутоидентификацию(IPТелефонияПодключаемоеОборудование, JSONСообщение, Sign, ОтносительныйURL = "")
	
	Попытка
		
		IPТелефонияПараметры = IPТелефонияПодключаемоеОборудование.Параметры.Получить();

		// Проверка
		ВычисленныйSign = IPТелефония.SHA256(IPТелефонияПараметры.КодПродукта + JSONСообщение + IPТелефонияПараметры.Ключ);
		Если ВычисленныйSign <> Sign Тогда 
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Функция, возвращает параметры запроса.
//
Функция ПолучитьПараметрыЗапроса(ТекстJSON)
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстJSON);
		Возврат ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Возврат Неопределено;
	КонецПопытки;   
	
КонецФункции

// Функция, возвращает HTTPОтвет.
//
// Параметры:
//  КодОтвета	 - 	 - 
//  Описание	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьHTTPОтветAPI(КодОтвета, Ответ1С, КодироватьВJSON = Ложь, ЗаголовокUrlencoded = Ложь)
		 		
	HTTPОтвет = Новый HTTPСервисОтвет(КодОтвета);
	
	Если КодироватьВJSON Тогда
		HTTPОтвет.УстановитьТелоИзСтроки(КодироватьВJSON(Ответ1С, Ложь));
	Иначе
		HTTPОтвет.УстановитьТелоИзСтроки(Ответ1С);
	КонецЕсли;
	
	Если ЗаголовокUrlencoded Тогда
		HTTPОтвет.Заголовки["Content-Type"] = "application/x-www-form-urlencoded";
	Иначе
		HTTPОтвет.Заголовки["Content-Type"] = "application/json";	
	КонецЕсли;
	
	Возврат HTTPОтвет; 
	
КонецФункции

// Функция возвращает структуру с заголовками запроса в нижнем регистре.
// 
// Параметры:
//  Запрос	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция ПривестиЗаголовкиВНижнийРегистр(Запрос)
	
	СоответствиеСЗаголовками = Новый Соответствие;
	
	Для Каждого Заголовок Из Запрос.Заголовки Цикл
		СоответствиеСЗаголовками.Вставить(НРег(Заголовок.Ключ), Заголовок.Значение);
	КонецЦикла;
	
	Возврат СоответствиеСЗаголовками;
	
КонецФункции

Функция CallTouchEventsPOST(Запрос)

   	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.CallTouchEvents", УровеньЖурналаРегистрации.Информация, , , 
	"Вызов функции. Переданные параметры: " + Символы.ПС + РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL));
	
	// Логирование
	ЛогироватьСобытие = Ложь; //Константы.ЛогироватьHTTP.Получить();	
	
	Если ЛогироватьСобытие > 0 Тогда
		ВремяНачалаОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		UIDЗапроса     = Новый УникальныйИдентификатор();
		HTTPЗапросЛога = Запрос;
		ДатаЛога       = ТекущаяДатаСеанса();
		ТипЗапроса     = Перечисления.HTTPСервисы.IPТелефония;
		HTTPШаблон     = "CallTouchEvents";
		
	КонецЕсли;
	//\\

	ТелоЗапроса   = РаскодироватьСтроку(Запрос.ПолучитьТелоКакСтроку(), СпособКодированияСтроки.КодировкаURL);	
	ПараметрыТела = Новый Структура();
	
	Для Каждого СтрокаМ Из СтрРазделить(ТелоЗапроса, "&") Цикл 
		
		Массив = СтрРазделить(СтрокаМ, "=");
		Если Массив.Количество() > 1 Тогда 
			РаспарситьСтроку(ПараметрыТела, Массив[0], Массив[1]); 
		КонецЕсли;
	КонецЦикла; 	
	
	Ответ1С = Новый Структура("Success, Description", Истина, "");
	Ответ = Неопределено;
	
	Попытка
		
		// Проверка Аутоидентификации
		ПОIPТелефонии = IPТелефония.ОпределитьПодключаемоеОборудование(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикХеликсCallTouch);
		//IPТелефонияПараметры = ПОIPТелефонии.Параметры.Получить();
		
		Если Не ЗначениеЗаполнено(ПОIPТелефонии) Тогда
			Ответ1С.Success = Ложь;
			Ответ1С.Description = "Аутентификация не пройдена (Сервис IP-телефонии не настроен)";
		//ИначеЕсли Не ПараметрыТела.crm_token = IPТелефонияПараметры.Ключ Тогда
		//	Ответ1С.Success = Ложь;        
		//	Ответ1С.Description = "Аутентификация не пройдена";
		КонецЕсли;
				
		ОбязательныйПараметр = "id";		
		
		Если Ответ1С.Success = Истина Тогда  			
			
			Если Не ПараметрыТела.Свойство(ОбязательныйПараметр) Тогда
				Ответ1С.Success = Ложь;					
				Ответ1С.Description = СтрШаблон(НСтр("ru='Отсутствует обязательный параметр %1.';en='Missing required parameter %1.'"), ОбязательныйПараметр);
			КонецЕсли;      			
			
			Если Ответ1С.Success Тогда
				Ответ1С.Success = IPТелефония.CallTouch_СобытиеЗвонок(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);
				Если Ответ1С.Success Тогда 
					
					//РегистрыСведений.СквознаяАналитика.Добавить(ПараметрыТела);
					Если ПараметрыТела.callphase = "calldisconnected" Тогда
						Ответ1С.Success = IPТелефония.CallTouch_СобытиеЗаписьРазговора(ПОIPТелефонии, ПараметрыТела, Ответ1С.Description);					
					КонецЕсли;
					
				КонецЕсли;				
			КонецЕсли;			
		КонецЕсли;
		
		Если Ответ1С.Success = Ложь Тогда
			ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.CallTouchEvents", УровеньЖурналаРегистрации.Предупреждение, , , 
			"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		КонецЕсли;		
		
	Исключение
		
		Ответ1С.Success = Ложь;
		Ответ1С.Description = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());		
		
		ЗаписьЖурналаРегистрации("Http-сервисы.IPТелефония.CallTouchEvents", УровеньЖурналаРегистрации.Ошибка, , , 
		"" + Ответ1С.Description + Символы.ПС + Запрос.ПолучитьТелоКакСтроку());
		
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);	
	
	// Логирование
	Если ЛогироватьСобытие > 0 Тогда
		
		ВремяОкончанияОперации = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ВремяВыполнения        = (ВремяОкончанияОперации - ВремяНачалаОперации)/1000;
		мОтвет                 = Ответ.ПолучитьТелоКакСтроку();
		мОтвет                 = ?(Ответ1С.Success = Ложь, Ответ1С.Description, мОтвет);
		КодОтвета              = ?(Ответ1С.Success = Ложь, 400, 200);
		Статус                 = ?(Ответ1С.Success = Ложь, Перечисления.СтатусыЗапросов.ЗавершенСОшибками, Перечисления.СтатусыЗапросов.Выполнен);
		
		Если ОбщегоНазначения.ВыполнитьЛогированиеЗапроса(ЛогироватьСобытие, Статус, ВремяВыполнения) Тогда
			
			РегистрыСведений.ЖурналЗапросов.ЛогироватьЗапрос(
				HTTPЗапросЛога, 
				ДатаЛога, 
				UIDЗапроса, 
				ТипЗапроса, 
				HTTPШаблон, 
				Статус, 
				ВремяВыполнения, 
				, 
				, 
				мОтвет, 
				, 
				,
				КодОтвета); 								
			
		КонецЕсли;
	КонецЕсли;

	Возврат Ответ;
	
КонецФункции

#КонецОбласти
